SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( Velaro_7
	Type ( Engine )
	WagonShape ( Velaro_7.s )
 	Size  ( 3.16m 4.23m 24.8m)
	CentreOfGravity ( 0m 1.6m 0m )
	Mass ( 78t )
	WheelRadius ( 0.83m )
	InertiaTensor ( Box (3m 4.5m 24.8m) )
	Coupling (
		Type ( Automatic )
		Spring (
			Stiffness ( 2e7N/m 0  )
			Damping ( 0.2e7N/m/s 0 )
			Break ( 1e7N 0 )
			r0 ( 0.1 1e9 )
		)
		CouplingHasRigidConnection ()
	)
	Buffers (
		Spring (
			Stiffness ( 1e7N/m 0 )
			Damping ( 1e6N/m/s 0 )
			r0 ( 0m 1e9 )
		)
		Centre ( 0.5 )
		Radius ( 1 )
		Angle ( 0.5deg )
	)

	comment( guessed brake force )
	MaxBrakeForce ( 150kN )
	Adheasion ( 0.2 0.4 2 0 )
	DerailRailHeight ( 4cm )
	DerailRailForce ( 230kN )
	DerailBufferForce ( 200kN )
	NumWheels ( 8 )
	Friction (
		150N/m/s		1		-1mph		0		1
		5.1N/rad/s		1		-1rad/s		0		1
	)
	AntiSlip ()
	
	BrakeEquipmentType( "handbrake, triple_valve, ep_brake, auxiliary_reservoir, Distributor" )
	BrakeSystemType( "ECP" )
	
	MaxBrakeForce( 240kN )

	EmergencyBrakeResMaxPressure( 110 )
	TripleValveRatio( 2.5 )
	MaxReleaseRate( 20 )
	MaxApplicationRate( 20 )
	MaxAuxilaryChargingRate( 30 )
	EmergencyResCapacity( 10 )
	EmergencyResChargingRate( 30 )
	BrakeCylinderPressureForMaxBrakeBrakeForce( 70 )

	BrakeDistributorFullServicePressure( 82 )
	BrakeDistributorMaxAuxilaryResPressure( 110 )
	BrakeDistributorEmergencyResPressure( 110 )
	BrakeDistributorReleaseRate( 10 )
	BrakeDistributorApplicationRate( 15 )
	BrakeDistributorTrainPipeControlRatio( 2.03 )
	BrakeDistributorNormalFullReleasePressure( 110 )
	
    	Sound (	"ICE3Out.sms" )

	
	)

    Engine ( Velaro_7
    Wagon ( Velaro_7 )
    Type ( Electric )
    MaxPower ( 2800kW )
    MaxForce ( 300kN#est )
    MaxContinuousForce ( 280kN )
    MaxVelocity ( 320Kmh )
    MaxCurrent ( 1400A )
    WheelRadius ( 0.83m )
    Sanding ( 1e9mph )
    NumWheels ( 1 )

    
    AirBrakesAirCompressorPowerRating( 4 )
    AirBrakesMainMinResAirPressure( 0 )
    AirBrakesMainMaxAirPressure( 140 )
    AirBrakesMainResVolume( 10 )
    AirBrakesAirCompressorWattage( 19000 )
    AirBrakesCompressorRestartPressure( 130 )
    AirBrakesAirUsedPerPoundsOfBrakePipePressure( 0.5 )
    AirBrakesHasLowPressureTest( 1 )
    AirBrakesIsCompressorElectricOrMechanical( 0 )

    EngineBrakesControllerHasProportionalBrake( 1 )
    EngineBrakesProportionalBrakeLag( 1 )

    TrainBrakesControllerMinPressureReduction( 6 )
    TrainBrakesControllerMaxApplicationRate( 14 )
    TrainBrakesControllerMaxReleaseRate( 6 )
    TrainBrakesControllerEmergencyApplicationRate( 40 )
    TrainBrakesControllerMinSystemPressure( 0 )
    TrainBrakesControllerMaxSystemPressure( 110 )
    TrainBrakesControllerEmergencyBrakeTimePenalty( 5 )
    TrainBrakesControllerFullServicePressureDrop( 26 )

    DynamicBrakesMinUsableSpeed( 5 )
    DynamicBrakesMaximumEffectiveSpeed( 150 )
    DynamicBrakesMaximumForce( 20000 )
    DynamicBrakesResistorCurrentLimit ( 5000 )
    DynamicBrakesCutInSpeed( 2 )
    DynamicBrakesMaxAirBrakePressure ( 20 )
    DynamicBrakesFadingSpeed( 10 )
    DynamicBrakesDelayTimeBeforeEngaging ( 1 )
    DynamicBrakesMaximumSpeedForFadeOut ( 130 )
    DynamicBrakesEffectAtMaximumFadeOut( 0 )
    DynamicBrakesHigherSpeedCurveExponent( 1 )
    DynamicBrakesLowerSpeedCurveExponent( 1 )
    DynamicBrakesNumberOfControllerNotches( 8 )

    BrakesEngineBrakeType( "ECP"  )
    BrakesTrainBrakeType( "ECP" )
    BrakesEngineControllers( "Combined, Train, Dynamic, Blended" )
    
    DoesBrakeCutPower( 1 )
    DoesHornTriggerBell( 1 )
    BrakeCutsPowerAtBrakeCylinderPressure( 15 )
    
	EmergencyStopMonitor(
		MonitoringDeviceMonitorTimeLimit( 0 )
		MonitoringDeviceAlarmTimeLimit( 0 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 0 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 0 )
		MonitoringDeviceAppliesEmergencyBrake( 1 )
		MonitoringDeviceAppliesCutsPower( 1 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
		)

	VigilanceMonitor(
		MonitoringDeviceMonitorTimeLimit( 120 )
		MonitoringDeviceAlarmTimeLimit( 90 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 0 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 1 )
		MonitoringDeviceAppliesEmergencyBrake( 1 )
		MonitoringDeviceAppliesCutsPower( 1 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
		)

	OverspeedMonitor(
		MonitoringDeviceMonitorTimeLimit( 0 )
		MonitoringDeviceAlarmTimeLimit( 5 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 240 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 0 )
		MonitoringDeviceAppliesEmergencyBrake( 0 )
		MonitoringDeviceAppliesCutsPower( 0 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
		MonitoringDeviceTriggerOnTrackOverspeed( 1 )
		MonitoringDeviceTriggerOnTrackOverspeedMargin( 2 )
		MonitoringDeviceResetOnZeroSpeed( 0 ) 
		MonitoringDeviceResetOnResetButton( 0 )
		)

    Sound ( "ICE3Out.sms" )
    Name ( "Velaro.7 Stromrichterwagenwagen" )
    Description (
	"Zur Ergänzung der vorhandenen ICE-Flotte bestellte die DB fünzig Züge "+
	"der neuen Generation ICE 3. Die Auslieferung durch Siemens und Adtranz "+
	"erfolgt ab 1999, wobei 37 Einsystemzüge (BR 403) und 13 Viersystemzüge "+
	"(BR 406) bestellt sind. Weiter vier Viersystemzüge gehen an die "+
	"Niederländischen Staatsbahnen. Für die Züge ist eine Höchstgeschwindigkeit"+
	"von 330 km/h vorgesehen\n\n"+
	"Der ICE 3 wird als achtteiliger Triebzug ohne separate Triebköpfe gebaut. "+
	"Die Antriebs- und Steuerungseinrichtungen sind unterflur unter den einzelnen "+
	"Wagen gebaut.\n\n"+
	"Ein Zug besteht aus vier angetriebenen Wagen; jeweils ein Endwagen, ein nicht "+
	"angetriebener Trafowagen, ein angetriebener Stromrichterwagen und ein antriebslo"+
	"ser Mittelwagen bilden dabei eine elektrisch zusammengehörende Einheit. "+
	"Durch dieses Antriebskonzept werden Steigungen von 40 Promille bei nur 16 Tonnen "+
	"Radsatzlast bewältigt. Die Zugkombination sieht in der regel wie folgt aus:\n\n"+
	"403.0 Endwagen, 1.Klasse\n"+
	"403.1 Trafowagen, 1.Klasse\n"+
	"403.2 Stromrichterwagen, 1.Klasse\n"+
	"403.3 Mittelwagen, Restaurant\n"+
	"403.8 Mittelwagen, 2.Klasse\n"+
	"403.7 Stromrichterwagen, 2.Klasse\n"+
	"403.6 Trafowagen, 2.Klasse\n"+
	"403.5 Endwagen, 2.Klasse\n\n"+
	"Der ICE bietet damit 130 Plätze in der ersten und 244 Plätze in der zweiten Klasse. "+
	"Dazu kommen 24 Plätze im Restaurant, zehn Toiletten (davon eine behindertengerecht)"+
	" und eine Personaltoilette."
    )
    EngineOperatingProcedures (
    "So setzen Sie den Zug in Bewegung\n"+
    "1. Der Stromabnehmer wurde bereits ausgefahren. (Sollte dies aus irgendeinem Grund noch nicht geschehen sein, drücken Sie die P-TASTE, um den Stromabnehmer auszufahren.)\n"+
    "2.	Drücken Sie die W-TASTE, um den Richtungshebel in die Position Vorwärts zu stellen.\n"+
    "3.	Drücken Sie die Ö-TASTE, um die Zugbremsen zu lösen.\n"+
    "4.	Drücken Sie die D-TASTE, um die Reglereinstellung zu erhöhen.\n\n"+  
    "So bremsen Sie den Zug ab\n"+
    "1.	Drücken Sie die A-TASTE, um den Regler nach unten zu bewegen.\n"+
    "2.	Setzen Sie die Bremsen ein, wenn Sie noch weiter abbremsen möchten.\n\n"+   
    "So bedienen Sie die Zugbremsen\n"+
    "1.	Drücken Sie die Ä-TASTE, um die Zugbremse zu ziehen.\n\n"+
    "So lösen Sie die Zugbremsen\n"+
    "1. Drücken Sie die Ö-TASTE, um die Zugbremsen zu lösen.\n\n"+
    "So lösen Sie die Notbremse aus\n"+
    "1.	Drücken Sie die A-TASTE, um den Regler in die Position Leerlauf zu stellen.\n"+
    "2.	Drücken Sie die RÜCKTASTE, um die Notbremsung auszulösen.\n\n"+
    "So fahren Sie rückwärts\n"+
    "1.	Halten Sie den Zug vollständig an.\n"+
    "2.	Drücken Sie die S-TASTE, um den Richtungshebel in die Position Rückwärts zu stellen.\n"+
    "3.	Drücken Sie die Ö-TASTE, um die Bremsen zu lösen.\n"+
    "4.	Schieben Sie den Regler langsam nach vorne (D-TASTE).\n\n"+
    "So lassen Sie Fahrgäste ein- und aussteigen\n"+
    "1. Halten Sie an einem Bahnhof an.\n"+
    "2. Drücken Sie die EINGABETASTE.\n"+
    "3. Warten Sie, bis das Signal die Erlaubnis zur Abfahrt gibt.\n"+
    "TIPP: Verwenden Sie die Lokführerinformation 'Nächster Halt' (F10), um das Ein- und Aussteigen zu überwachen."
    ) 
    
    EngineControllers (
        Throttle ( 0 1 0.025 0
            NumNotches ( 0 )
        )
        Brake_Train ( 0 1 0.0125 0.5 
            NumNotches ( 6
                Notch ( 0       0 TrainBrakesControllerReleaseStart )
                Notch ( 0.2	0 TrainBrakesControllerHoldLappedStart )
                Notch ( 0.25    1 TrainBrakesControllerGraduatedSelfLapLimitedHoldingStart )
                Notch ( 0.85    0 TrainBrakesControllerSuppressionStart )
                Notch ( 0.9     0 TrainBrakesControllerContinuousServiceStart )
                Notch ( 0.95    0 TrainBrakesControllerEmergencyStart )
            )
        )
        Brake_Dynamic ( 0 1 0.0125 0 
            NumNotches( 0 )
        )
        DirControl ( -1 0 1 1 )
        EmergencyStopResetToggle( 0 1 0 )
        EmergencyStopToggle( 0 1 0 )
        AWS ( 0 1 0 )
        Sanding ( 0 1 0 )
        Horn ( 0 1 0 )
        Vigilance ( 0 1 0 )
        PantographToggle1 ( 0 1 1 )
        Headlights ( 0 0.25 1 0 )
        Wipers ( 0 1 0 )
        BellToggle( 0 1 0 )
    )
)
